# Задание 1. Переменные
var_int = 5
var_float = 5.5
var_str = 'число 5'
var_bool = True
print(f'Переменные различных типов: Целое число: {var_int}, с плавающей точкой: {var_float}, строка: "{var_str}", булево значение: {var_bool}')
number_1 = int(input('Введите первое целое число '))
number_2 = int(input('Введите второе целое число '))
print(f'Сумма введенных чисел {number_1 + number_2}')
name = input('Введите Ваше имя ')
surname = input('Введите Вашу фамилю ')
print('Здравствуйте', name, surname)
