# Задание 3. n + nn + nnn
n_str = input('Введите целое чило n ')
n = int(n_str)
nn = int(n_str + n_str)
nnn = int(n_str + n_str + n_str)
print (f'сумма чисел {n} {nn}, {nnn} равна {n + nn + nnn}')
