# Задание 6. Товары

# # вариант для проверки без ручного заполнения
# list_product = [
# (1, {'название': 'компьютер', 'цена': 20000, 'количество': 5, 'ед': 'шт.'}),
# (2, {'название': 'принтер', 'цена': 6000, 'количество': 2, 'ед': 'шт.'}),
# (3, {'название': 'сканер', 'цена': 2000, 'количество': 7, 'ед': 'шт.'}),
# (4, {'название': 'скрепки', 'цена': 15.5, 'количество': 10, 'ед': 'кг.'})
# ]

# вариант для ввода данных пользователем
list_product = []
answer = 'y'
i = 1
while answer == 'y':
    number = i
    name = input('Название товара ')
    price = float(input('Цена '))
    quantity = int(input('Количество '))
    unit = input('Единица измерения ')
    list_product.append((number, {'название': name, 'цена': price, 'количество': quantity, 'ед': unit}))
    i += 1
    answer = input('Вы хотите добавить товар? (y/n) ')
# print(list_product)

resut_dic = {'название': [], 'цена': [], 'количество': [], 'ед': []}

for el in list_product:
    resut_dic['название'].append(el[1].get('название'))
    resut_dic['цена'].append(el[1].get('цена'))
    resut_dic['количество'].append(el[1].get('количество'))
    resut_dic['ед'].append(el[1].get('ед'))
print(resut_dic)
