# Задание 3. Месяцы
season_list = [
    [1, 'зима'], [2, 'зима'], [3, 'весна'], [4, 'весна'], [5, 'весна'], [6, 'лето'], [7, 'лето'], [8, 'лето'],
    [9, 'осень'], [10, 'осень'], [11, 'осень'], [12, 'зима']
]
month_num = int(input('Введите месяц в виде целого числа от 1 до 12 '))
print('Время года -', season_list[month_num - 1][1])

# второй вариант решения, через словарь
season_dic = {
    1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето',
    9: 'осень', 10: 'осень', 11: 'осень', 12: 'зима'
}
print('Время года -', season_dic.get(month_num))
